jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x14x1.cpp
#ifndef TXBUF_0_
#define TXBUF_0_ 0x0077
#endif
#ifndef TXBUF_0
#define TXBUF_0 0x0077
#endif
#ifndef MPY_
#define MPY_ 0x0130
#endif
#ifndef MPY
#define MPY 0x0130
#endif
#ifndef URXSE
#define URXSE 0x08
#endif
#ifndef TXBUF_1_
#define TXBUF_1_ 0x007F
#endif
#ifndef TXBUF_1
#define TXBUF_1 0x007F
#endif
#ifndef __msp430_headers_flash_h
#define __msp430_headers_flash_h 
#endif
#ifndef PENA
#define PENA 0x80
#endif
#ifndef MC_UPDOWN
#define MC_UPDOWN MC_3
#endif
#ifndef __FLT_MIN__
#define __FLT_MIN__ 1.17549435e-38F
#endif
#ifndef __FLT_MIN_
#define __FLT_MIN_ 1.17549435e-38F
#endif
#ifndef P1IES_
#define P1IES_ 0x0024
#endif
#ifndef P1IES
#define P1IES 0x0024
#endif
#ifndef CKPH
#define CKPH 0x80
#endif
#ifndef CKPL
#define CKPL 0x40
#endif
#ifndef U0IE
#define U0IE IE1
#endif
#ifndef __ASSEMBLER__
#define __ASSEMBLER__ 1
#endif
#ifndef __ASSEMBLER_
#define __ASSEMBLER_ 1
#endif
#ifndef XTS
#define XTS 0x40
#endif
#ifndef URCTL_
#define URCTL_ 0x0072
#endif
#ifndef URCTL
#define URCTL 0x0072
#endif
#ifndef __MSP430_HAS_PORT3__
#define __MSP430_HAS_PORT3__ 
#endif
#ifndef __MSP430_HAS_PORT3_
#define __MSP430_HAS_PORT3_ 
#endif
#ifndef __CHAR_BIT__
#define __CHAR_BIT__ 8
#endif
#ifndef __CHAR_BIT_
#define __CHAR_BIT_ 8
#endif
#ifndef TBCCTL3_
#define TBCCTL3_ 0x0188
#endif
#ifndef TBCCTL3
#define TBCCTL3 0x0188
#endif
#ifndef P5DIR_
#define P5DIR_ 0x0032
#endif
#ifndef P5DIR
#define P5DIR 0x0032
#endif
#ifndef TBSSEL_ACLK
#define TBSSEL_ACLK TBSSEL_1
#endif
#ifndef __WINT_MAX__
#define __WINT_MAX__ 65535U
#endif
#ifndef __WINT_MAX_
#define __WINT_MAX_ 65535U
#endif
#ifndef TA0R_
#define TA0R_ 0x0170
#endif
#ifndef TA0R
#define TA0R 0x0170
#endif
#ifndef TXEPT
#define TXEPT 0x01
#endif
#ifndef USART0TX_VECTOR
#define USART0TX_VECTOR 16
#endif
#ifndef __msp430_have_timerb7
#define __msp430_have_timerb7 
#endif
#ifndef __SIZE_MAX__
#define __SIZE_MAX__ 65535U
#endif
#ifndef __SIZE_MAX_
#define __SIZE_MAX_ 65535U
#endif
#ifndef U1IFG
#define U1IFG IFG2
#endif
#ifndef __WCHAR_MAX__
#define __WCHAR_MAX__ 32767
#endif
#ifndef __WCHAR_MAX_
#define __WCHAR_MAX_ 32767
#endif
#ifndef MC0
#define MC0 0x0010
#endif
#ifndef __msp430x14x1
#define __msp430x14x1 
#endif
#ifndef SEGWRT
#define SEGWRT 0x0080
#endif
#ifndef __FLT_EVAL_METHOD__
#define __FLT_EVAL_METHOD__ 0
#endif
#ifndef __FLT_EVAL_METHOD_
#define __FLT_EVAL_METHOD_ 0
#endif
#ifndef FN0
#define FN0 0x0001
#endif
#ifndef FN1
#define FN1 0x0002
#endif
#ifndef FN3
#define FN3 0x0008
#endif
#ifndef FN4
#define FN4 0x0010
#endif
#ifndef FN5
#define FN5 0x0020
#endif
#ifndef SELS
#define SELS 0x08
#endif
#ifndef CM_BOTH
#define CM_BOTH CM_3
#endif
#ifndef UTCTL0_
#define UTCTL0_ 0x0071
#endif
#ifndef UTCTL0
#define UTCTL0 0x0071
#endif
#ifndef CAIES
#define CAIES 0x04
#endif
#ifndef UTCTL1_
#define UTCTL1_ 0x0079
#endif
#ifndef UTCTL1
#define UTCTL1 0x0079
#endif
#ifndef CAIFG
#define CAIFG 0x01
#endif
#ifndef __FINITE_MATH_ONLY__
#define __FINITE_MATH_ONLY__ 0
#endif
#ifndef __FINITE_MATH_ONLY_
#define __FINITE_MATH_ONLY_ 0
#endif
#ifndef U0MCTL_
#define U0MCTL_ 0x0073
#endif
#ifndef U0MCTL
#define U0MCTL 0x0073
#endif
#ifndef __GNUC_PATCHLEVEL__
#define __GNUC_PATCHLEVEL__ 3
#endif
#ifndef __GNUC_PATCHLEVEL_
#define __GNUC_PATCHLEVEL_ 3
#endif
#ifndef UTCTL_0_
#define UTCTL_0_ 0x0071
#endif
#ifndef UTCTL_0
#define UTCTL_0 0x0071
#endif
#ifndef TBCTL_
#define TBCTL_ 0x0180
#endif
#ifndef TBCTL
#define TBCTL 0x0180
#endif
#ifndef RESHI_
#define RESHI_ 0x013C
#endif
#ifndef RESHI
#define RESHI 0x013C
#endif
#ifndef FSSEL0
#define FSSEL0 0x0040
#endif
#ifndef FSSEL1
#define FSSEL1 0x0080
#endif
#ifndef P4DIR_
#define P4DIR_ 0x001E
#endif
#ifndef P4DIR
#define P4DIR 0x001E
#endif
#ifndef __DEC64_MAX_EXP__
#define __DEC64_MAX_EXP__ 385
#endif
#ifndef __DEC64_MAX_EXP_
#define __DEC64_MAX_EXP_ 385
#endif
#ifndef P2CA0
#define P2CA0 0x04
#endif
#ifndef P2CA1
#define P2CA1 0x08
#endif
#ifndef UART1TX_VECTOR
#define UART1TX_VECTOR USART1TX_VECTOR
#endif
#ifndef __SHRT_MAX__
#define __SHRT_MAX__ 32767
#endif
#ifndef __SHRT_MAX_
#define __SHRT_MAX_ 32767
#endif
#ifndef __LDBL_MAX__
#define __LDBL_MAX__ 3.40282347e+38L
#endif
#ifndef __LDBL_MAX_
#define __LDBL_MAX_ 3.40282347e+38L
#endif
#ifndef DIVA_DIV1
#define DIVA_DIV1 DIVA_0
#endif
#ifndef DIVA_DIV2
#define DIVA_DIV2 DIVA_1
#endif
#ifndef DIVA_DIV4
#define DIVA_DIV4 DIVA_2
#endif
#ifndef DIVA_DIV8
#define DIVA_DIV8 DIVA_3
#endif
#ifndef BIT0
#define BIT0 0x0001
#endif
#ifndef BIT1
#define BIT1 0x0002
#endif
#ifndef BIT2
#define BIT2 0x0004
#endif
#ifndef BIT3
#define BIT3 0x0008
#endif
#ifndef BIT4
#define BIT4 0x0010
#endif
#ifndef BIT5
#define BIT5 0x0020
#endif
#ifndef BIT7
#define BIT7 0x0080
#endif
#ifndef BIT8
#define BIT8 0x0100
#endif
#ifndef BIT9
#define BIT9 0x0200
#endif
#ifndef BITA
#define BITA 0x0400
#endif
#ifndef BITB
#define BITB 0x0800
#endif
#ifndef BITC
#define BITC 0x1000
#endif
#ifndef BITD
#define BITD 0x2000
#endif
#ifndef BITE
#define BITE 0x4000
#endif
#ifndef BITF
#define BITF 0x8000
#endif
#ifndef SELM_XT2CLK
#define SELM_XT2CLK SELM_2
#endif
#ifndef __UINTMAX_TYPE__
#define __UINTMAX_TYPE__ long long unsigned int
#endif
#ifndef __UINTMAX_TYPE_
#define __UINTMAX_TYPE_ long long unsigned int
#endif
#ifndef CHAR
#define CHAR 0x10
#endif
#ifndef WDTCNTCL
#define WDTCNTCL 0x0008
#endif
#ifndef __DEC32_EPSILON__
#define __DEC32_EPSILON__ 1E-6DF
#endif
#ifndef __DEC32_EPSILON_
#define __DEC32_EPSILON_ 1E-6DF
#endif
#ifndef TAIV_CCR2
#define TAIV_CCR2 0x04
#endif
#ifndef CCTL0_
#define CCTL0_ TA0CCTL0_
#endif
#ifndef CCTL0
#define CCTL0 TA0CCTL0
#endif
#ifndef MPYS_
#define MPYS_ 0x0132
#endif
#ifndef MPYS
#define MPYS 0x0132
#endif
#ifndef OUTMOD0
#define OUTMOD0 0x0020
#endif
#ifndef CCTL1_
#define CCTL1_ TA0CCTL1_
#endif
#ifndef CCTL1
#define CCTL1 TA0CCTL1
#endif
#ifndef __LDBL_MAX_EXP__
#define __LDBL_MAX_EXP__ 128
#endif
#ifndef __LDBL_MAX_EXP_
#define __LDBL_MAX_EXP_ 128
#endif
#ifndef RXERR
#define RXERR 0x01
#endif
#ifndef CCTL2_
#define CCTL2_ TA0CCTL2_
#endif
#ifndef CCTL2
#define CCTL2 TA0CCTL2
#endif
#ifndef __WINT_MIN__
#define __WINT_MIN__ 0U
#endif
#ifndef __WINT_MIN_
#define __WINT_MIN_ 0U
#endif
#ifndef U1TXBUF_
#define U1TXBUF_ 0x007F
#endif
#ifndef U1TXBUF
#define U1TXBUF 0x007F
#endif
#ifndef TBIV_NONE
#define TBIV_NONE 0x00
#endif
#ifndef P3IN_
#define P3IN_ 0x0018
#endif
#ifndef P3IN
#define P3IN 0x0018
#endif
#ifndef __SCHAR_MAX__
#define __SCHAR_MAX__ 127
#endif
#ifndef __SCHAR_MAX_
#define __SCHAR_MAX_ 127
#endif
#ifndef P2IFG_
#define P2IFG_ 0x002B
#endif
#ifndef P2IFG
#define P2IFG 0x002B
#endif
#ifndef TAIFG
#define TAIFG 0x0001
#endif
#ifndef UTCTL_1_
#define UTCTL_1_ 0x0079
#endif
#ifndef UTCTL_1
#define UTCTL_1 0x0079
#endif
#ifndef TASSEL_ACLK
#define TASSEL_ACLK TASSEL_1
#endif
#ifndef TACTL_
#define TACTL_ TA0CTL_
#endif
#ifndef TACTL
#define TACTL TA0CTL_
#endif
#ifndef CCR0_
#define CCR0_ TA0CCR0_
#endif
#ifndef CCR0
#define CCR0 TA0CCR0
#endif
#ifndef __DBL_DIG__
#define __DBL_DIG__ 6
#endif
#ifndef __DBL_DIG_
#define __DBL_DIG_ 6
#endif
#ifndef CCR1_
#define CCR1_ TA0CCR1_
#endif
#ifndef CCR1
#define CCR1 TA0CCR1
#endif
#ifndef P3DIR_
#define P3DIR_ 0x001A
#endif
#ifndef P3DIR
#define P3DIR 0x001A
#endif
#ifndef DCO0
#define DCO0 0x20
#endif
#ifndef DCO1
#define DCO1 0x40
#endif
#ifndef DCO2
#define DCO2 0x80
#endif
#ifndef DCOR
#define DCOR 0x01
#endif
#ifndef CCR2_
#define CCR2_ TA0CCR2_
#endif
#ifndef CCR2
#define CCR2 TA0CCR2
#endif
#ifndef P6OUT_
#define P6OUT_ 0x0035
#endif
#ifndef P6OUT
#define P6OUT 0x0035
#endif
#ifndef __SIZEOF_INT__
#define __SIZEOF_INT__ 2
#endif
#ifndef __SIZEOF_INT_
#define __SIZEOF_INT_ 2
#endif
#ifndef __SIZEOF_POINTER__
#define __SIZEOF_POINTER__ 2
#endif
#ifndef __SIZEOF_POINTER_
#define __SIZEOF_POINTER_ 2
#endif
#ifndef URCTL_0_
#define URCTL_0_ 0x0072
#endif
#ifndef URCTL_0
#define URCTL_0 0x0072
#endif
#ifndef SELM0
#define SELM0 0x40
#endif
#ifndef SELM1
#define SELM1 0x80
#endif
#ifndef RXBUF_
#define RXBUF_ 0x0076
#endif
#ifndef RXBUF
#define RXBUF 0x0076
#endif
#ifndef U1MCTL_
#define U1MCTL_ 0x007B
#endif
#ifndef U1MCTL
#define U1MCTL 0x007B
#endif
#ifndef URCTL_1_
#define URCTL_1_ 0x007A
#endif
#ifndef URCTL_1
#define URCTL_1 0x007A
#endif
#ifndef CAP
#define CAP 0x0100
#endif
#ifndef TBIFG
#define TBIFG 0x0001
#endif
#ifndef P6SEL_
#define P6SEL_ 0x0037
#endif
#ifndef P6SEL
#define P6SEL 0x0037
#endif
#ifndef __USER_LABEL_PREFIX__
#define __USER_LABEL_PREFIX__ 
#endif
#ifndef __USER_LABEL_PREFIX_
#define __USER_LABEL_PREFIX_ 
#endif
#ifndef CCI
#define CCI 0x0008
#endif
#ifndef __STDC_HOSTED__
#define __STDC_HOSTED__ 1
#endif
#ifndef __STDC_HOSTED_
#define __STDC_HOSTED_ 1
#endif
#ifndef __LDBL_HAS_INFINITY__
#define __LDBL_HAS_INFINITY__ 1
#endif
#ifndef __LDBL_HAS_INFINITY_
#define __LDBL_HAS_INFINITY_ 1
#endif
#ifndef OUTMOD_RESET_SET
#define OUTMOD_RESET_SET OUTMOD_7
#endif
#ifndef __msp430_headers_mpy_h
#define __msp430_headers_mpy_h 
#endif
#ifndef TASSEL_TACLK
#define TASSEL_TACLK TASSEL_0
#endif
#ifndef ID_DIV1
#define ID_DIV1 ID_0
#endif
#ifndef ID_DIV2
#define ID_DIV2 ID_1
#endif
#ifndef ID_DIV4
#define ID_DIV4 ID_2
#endif
#ifndef ID_DIV8
#define ID_DIV8 ID_3
#endif
#ifndef TACLR
#define TACLR 0x0004
#endif
#ifndef RESLO_
#define RESLO_ 0x013A
#endif
#ifndef RESLO
#define RESLO 0x013A
#endif
#ifndef __FLT_EPSILON__
#define __FLT_EPSILON__ 1.19209290e-7F
#endif
#ifndef __FLT_EPSILON_
#define __FLT_EPSILON_ 1.19209290e-7F
#endif
#ifndef MERAS
#define MERAS 0x0004
#endif
#ifndef __MSP430__
#define __MSP430__ 1
#endif
#ifndef __MSP430_
#define __MSP430_ 1
#endif
#ifndef RXWAKE
#define RXWAKE 0x02
#endif
#ifndef __LDBL_MIN__
#define __LDBL_MIN__ 1.17549435e-38L
#endif
#ifndef __LDBL_MIN_
#define __LDBL_MIN_ 1.17549435e-38L
#endif
#ifndef CAEX
#define CAEX 0x80
#endif
#ifndef P6IN_
#define P6IN_ 0x0034
#endif
#ifndef P6IN
#define P6IN 0x0034
#endif
#ifndef EMEX
#define EMEX 0x0020
#endif
#ifndef __DEC32_MAX__
#define __DEC32_MAX__ 9.999999E96DF
#endif
#ifndef __DEC32_MAX_
#define __DEC32_MAX_ 9.999999E96DF
#endif
#ifndef CM0
#define CM0 0x4000
#endif
#ifndef CM1
#define CM1 0x8000
#endif
#ifndef P1IFG_
#define P1IFG_ 0x0023
#endif
#ifndef P1IFG
#define P1IFG 0x0023
#endif
#ifndef CAIE
#define CAIE 0x02
#endif
#ifndef COV
#define COV 0x0002
#endif
#ifndef OUTMOD_TOGGLE
#define OUTMOD_TOGGLE OUTMOD_4
#endif
#ifndef P2DIR_
#define P2DIR_ 0x002A
#endif
#ifndef P2DIR
#define P2DIR 0x002A
#endif
#ifndef __SIZEOF_LONG__
#define __SIZEOF_LONG__ 4
#endif
#ifndef __SIZEOF_LONG_
#define __SIZEOF_LONG_ 4
#endif
#ifndef UART0TX_VECTOR
#define UART0TX_VECTOR USART0TX_VECTOR
#endif
#ifndef P5OUT_
#define P5OUT_ 0x0031
#endif
#ifndef P5OUT
#define P5OUT 0x0031
#endif
#ifndef __DECIMAL_DIG__
#define __DECIMAL_DIG__ 9
#endif
#ifndef __DECIMAL_DIG_
#define __DECIMAL_DIG_ 9
#endif
#ifndef TBIV_
#define TBIV_ 0x011E
#endif
#ifndef TBIV
#define TBIV 0x011E
#endif
#ifndef FWKEY
#define FWKEY 0xA500
#endif
#ifndef SSEL0
#define SSEL0 0x10
#endif
#ifndef SSEL1
#define SSEL1 0x20
#endif
#ifndef TBIV_OVERFLOW
#define TBIV_OVERFLOW 0x0E
#endif
#ifndef P5SEL_
#define P5SEL_ 0x0033
#endif
#ifndef P5SEL
#define P5SEL 0x0033
#endif
#ifndef KEYV
#define KEYV 0x0002
#endif
#ifndef CAON
#define CAON 0x08
#endif
#ifndef __LDBL_HAS_QUIET_NAN__
#define __LDBL_HAS_QUIET_NAN__ 1
#endif
#ifndef __LDBL_HAS_QUIET_NAN_
#define __LDBL_HAS_QUIET_NAN_ 1
#endif
#ifndef LOCK
#define LOCK 0x0010
#endif
#ifndef DIVM_DIV1
#define DIVM_DIV1 DIVM_0
#endif
#ifndef DIVM_DIV2
#define DIVM_DIV2 DIVM_1
#endif
#ifndef DIVM_DIV4
#define DIVM_DIV4 DIVM_2
#endif
#ifndef DIVM_DIV8
#define DIVM_DIV8 DIVM_3
#endif
#ifndef FN2
#define FN2 0x0004
#endif
#ifndef __GNUC__
#define __GNUC__ 4
#endif
#ifndef __GNUC_
#define __GNUC_ 4
#endif
#ifndef SWRST
#define SWRST 0x01
#endif
#ifndef __MSP430_HAS_BASIC_CLOCK__
#define __MSP430_HAS_BASIC_CLOCK__ 
#endif
#ifndef __MSP430_HAS_BASIC_CLOCK_
#define __MSP430_HAS_BASIC_CLOCK_ 
#endif
#ifndef PORT2_VECTOR
#define PORT2_VECTOR 2
#endif
#ifndef __FLT_HAS_DENORM__
#define __FLT_HAS_DENORM__ 1
#endif
#ifndef __FLT_HAS_DENORM_
#define __FLT_HAS_DENORM_ 1
#endif
#ifndef __SIZEOF_LONG_DOUBLE__
#define __SIZEOF_LONG_DOUBLE__ 4
#endif
#ifndef __SIZEOF_LONG_DOUBLE_
#define __SIZEOF_LONG_DOUBLE_ 4
#endif
#ifndef U1IE
#define U1IE IE2
#endif
#ifndef TBSSEL_TBCLK
#define TBSSEL_TBCLK TBSSEL_0
#endif
#ifndef FSSEL_0
#define FSSEL_0 0x0000
#endif
#ifndef FSSEL_1
#define FSSEL_1 0x0040
#endif
#ifndef FSSEL_2
#define FSSEL_2 0x0080
#endif
#ifndef FSSEL_3
#define FSSEL_3 0x00C0
#endif
#ifndef __msp430_have_port1
#define __msp430_have_port1 
#endif
#ifndef __msp430_have_port2
#define __msp430_have_port2 
#endif
#ifndef __msp430_have_port3
#define __msp430_have_port3 
#endif
#ifndef TBSSEL_SMCLK
#define TBSSEL_SMCLK TBSSEL_2
#endif
#ifndef __msp430_have_port5
#define __msp430_have_port5 
#endif
#ifndef __msp430_have_port6
#define __msp430_have_port6 
#endif
#ifndef __MSP430_HAS_UART0__
#define __MSP430_HAS_UART0__ 
#endif
#ifndef __MSP430_HAS_UART0_
#define __MSP430_HAS_UART0_ 
#endif
#ifndef __MSP430_HAS_PORT4__
#define __MSP430_HAS_PORT4__ 
#endif
#ifndef __MSP430_HAS_PORT4_
#define __MSP430_HAS_PORT4_ 
#endif
#ifndef __BIGGEST_ALIGNMENT__
#define __BIGGEST_ALIGNMENT__ 2
#endif
#ifndef __BIGGEST_ALIGNMENT_
#define __BIGGEST_ALIGNMENT_ 2
#endif
#ifndef U1ME
#define U1ME ME2
#endif
#ifndef __DBL_HAS_INFINITY__
#define __DBL_HAS_INFINITY__ 1
#endif
#ifndef __DBL_HAS_INFINITY_
#define __DBL_HAS_INFINITY_ 1
#endif
#ifndef TACCR0_
#define TACCR0_ TA0CCR0_
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0_
#endif
#ifndef TAIE
#define TAIE 0x0002
#endif
#ifndef GIE
#define GIE 0x0008
#endif
#ifndef TAIV
#define TAIV TA0IV
#endif
#ifndef TACCR1_
#define TACCR1_ TA0CCR1_
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1_
#endif
#ifndef P1DIR_
#define P1DIR_ 0x0022
#endif
#ifndef P1DIR
#define P1DIR 0x0022
#endif
#ifndef WDTIS0
#define WDTIS0 0x0001
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef BLKWRT
#define BLKWRT 0x0080
#endif
#ifndef TACCR2_
#define TACCR2_ TA0CCR2_
#endif
#ifndef TACCR2
#define TACCR2 TA0CCR2_
#endif
#ifndef P4OUT_
#define P4OUT_ 0x001D
#endif
#ifndef P4OUT
#define P4OUT 0x001D
#endif
#ifndef SSEL_UCLKI
#define SSEL_UCLKI SSEL_0
#endif
#ifndef URXWIE
#define URXWIE 0x04
#endif
#ifndef MC_CONT
#define MC_CONT MC_2
#endif
#ifndef __msp430_headers_timerb_h__
#define __msp430_headers_timerb_h__ 
#endif
#ifndef __msp430_headers_timerb_h_
#define __msp430_headers_timerb_h_ 
#endif
#ifndef RSEL0
#define RSEL0 0x01
#endif
#ifndef RSEL1
#define RSEL1 0x02
#endif
#ifndef RSEL2
#define RSEL2 0x04
#endif
#ifndef P4SEL_
#define P4SEL_ 0x001F
#endif
#ifndef P4SEL
#define P4SEL 0x001F
#endif
#ifndef TAIV_NONE
#define TAIV_NONE 0x00
#endif
#ifndef UMCTL1_
#define UMCTL1_ 0x007B
#endif
#ifndef UMCTL1
#define UMCTL1 0x007B
#endif
#ifndef __LDBL_HAS_DENORM__
#define __LDBL_HAS_DENORM__ 1
#endif
#ifndef __LDBL_HAS_DENORM_
#define __LDBL_HAS_DENORM_ 1
#endif
#ifndef __DEC128_MAX__
#define __DEC128_MAX__ 9.999999999999999999999999999999999E6144DL
#endif
#ifndef __DEC128_MAX_
#define __DEC128_MAX_ 9.999999999999999999999999999999999E6144DL
#endif
#ifndef __USING_SJLJ_EXCEPTIONS__
#define __USING_SJLJ_EXCEPTIONS__ 1
#endif
#ifndef __USING_SJLJ_EXCEPTIONS_
#define __USING_SJLJ_EXCEPTIONS_ 1
#endif
#ifndef TBIV_CCR2
#define TBIV_CCR2 0x04
#endif
#ifndef __DEC32_MIN__
#define __DEC32_MIN__ 1E-95DF
#endif
#ifndef __DEC32_MIN_
#define __DEC32_MIN_ 1E-95DF
#endif
#ifndef SSEL_0
#define SSEL_0 0x00
#endif
#ifndef SSEL_1
#define SSEL_1 0x10
#endif
#ifndef SSEL_2
#define SSEL_2 0x20
#endif
#ifndef SSEL_3
#define SSEL_3 0x30
#endif
#ifndef TAR_
#define TAR_ TA0R_
#endif
#ifndef TAR
#define TAR TA0R_
#endif
#ifndef __DBL_MAX_EXP__
#define __DBL_MAX_EXP__ 128
#endif
#ifndef __DBL_MAX_EXP_
#define __DBL_MAX_EXP_ 128
#endif
#ifndef RXBUF_0_
#define RXBUF_0_ 0x0076
#endif
#ifndef RXBUF_0
#define RXBUF_0 0x0076
#endif
#ifndef __DEC128_EPSILON__
#define __DEC128_EPSILON__ 1E-33DL
#endif
#ifndef __DEC128_EPSILON_
#define __DEC128_EPSILON_ 1E-33DL
#endif
#ifndef RXBUF_1_
#define RXBUF_1_ 0x007E
#endif
#ifndef RXBUF_1
#define RXBUF_1 0x007E
#endif
#ifndef __PTRDIFF_MAX__
#define __PTRDIFF_MAX__ 2147483647L
#endif
#ifndef __PTRDIFF_MAX_
#define __PTRDIFF_MAX_ 2147483647L
#endif
#ifndef __MSP430_HAS_WDT__
#define __MSP430_HAS_WDT__ 
#endif
#ifndef __MSP430_HAS_WDT_
#define __MSP430_HAS_WDT_ 
#endif
#ifndef TA0CTL_
#define TA0CTL_ 0x0160
#endif
#ifndef TA0CTL
#define TA0CTL 0x0160
#endif
#ifndef UART1RX_VECTOR
#define UART1RX_VECTOR USART1RX_VECTOR
#endif
#ifndef TXBUF_
#define TXBUF_ 0x0077
#endif
#ifndef TXBUF
#define TXBUF 0x0077
#endif
#ifndef __LONG_LONG_MAX__
#define __LONG_LONG_MAX__ 9223372036854775807LL
#endif
#ifndef __LONG_LONG_MAX_
#define __LONG_LONG_MAX_ 9223372036854775807LL
#endif
#ifndef TBSSEL_INCLK
#define TBSSEL_INCLK TBSSEL_3
#endif
#ifndef __SIZEOF_SIZE_T__
#define __SIZEOF_SIZE_T__ 2
#endif
#ifndef __SIZEOF_SIZE_T_
#define __SIZEOF_SIZE_T_ 2
#endif
#ifndef UMCTL_
#define UMCTL_ 0x0073
#endif
#ifndef UMCTL
#define UMCTL 0x0073
#endif
#ifndef OUTMOD1
#define OUTMOD1 0x0040
#endif
#ifndef OUTMOD2
#define OUTMOD2 0x0080
#endif
#ifndef MSP430_NO_HWMUL
#define MSP430_NO_HWMUL 1
#endif
#ifndef WAIT
#define WAIT 0x0008
#endif
#ifndef __SIZEOF_WINT_T__
#define __SIZEOF_WINT_T__ 2
#endif
#ifndef __SIZEOF_WINT_T_
#define __SIZEOF_WINT_T_ 2
#endif
#ifndef OUTMOD_TOGGLE_RESET
#define OUTMOD_TOGGLE_RESET OUTMOD_2
#endif
#ifndef FSSEL_ACLK
#define FSSEL_ACLK FSSEL_0
#endif
#ifndef IE2_
#define IE2_ 0x0001
#endif
#ifndef IE2
#define IE2 0x0001
#endif
#ifndef UMCTL0_
#define UMCTL0_ 0x0073
#endif
#ifndef UMCTL0
#define UMCTL0 0x0073
#endif
#ifndef URXEIE
#define URXEIE 0x08
#endif
#ifndef P3OUT_
#define P3OUT_ 0x0019
#endif
#ifndef P3OUT
#define P3OUT 0x0019
#endif
#ifndef DIVA0
#define DIVA0 0x10
#endif
#ifndef DIVA1
#define DIVA1 0x20
#endif
#ifndef __GXX_ABI_VERSION
#define __GXX_ABI_VERSION 1002
#endif
#ifndef BIT6
#define BIT6 0x0040
#endif
#ifndef __msp430_headers_timera_h__
#define __msp430_headers_timera_h__ 
#endif
#ifndef __msp430_headers_timera_h_
#define __msp430_headers_timera_h_ 
#endif
#ifndef TASSEL0
#define TASSEL0 0x0100
#endif
#ifndef TASSEL1
#define TASSEL1 0x0200
#endif
#ifndef TASSEL2
#define TASSEL2 0x0400
#endif
#ifndef P1IE_
#define P1IE_ 0x0025
#endif
#ifndef P1IE
#define P1IE 0x0025
#endif
#ifndef P3SEL_
#define P3SEL_ 0x001B
#endif
#ifndef P3SEL
#define P3SEL 0x001B
#endif
#ifndef BUSY
#define BUSY 0x0001
#endif
#ifndef TIMERB1_VECTOR
#define TIMERB1_VECTOR 24
#endif
#ifndef TA0IV_
#define TA0IV_ 0x012E
#endif
#ifndef TA0IV
#define TA0IV 0x012E
#endif
#ifndef USART1RX_VECTOR
#define USART1RX_VECTOR 6
#endif
#ifndef __msp430_have_port4
#define __msp430_have_port4 
#endif
#ifndef TBCCR1_
#define TBCCR1_ 0x0194
#endif
#ifndef TBCCR1
#define TBCCR1 0x0194
#endif
#ifndef TXWAKE
#define TXWAKE 0x04
#endif
#ifndef U1BR0_
#define U1BR0_ 0x007C
#endif
#ifndef U1BR0
#define U1BR0 0x007C
#endif
#ifndef MC_STOP
#define MC_STOP MC_0
#endif
#ifndef __MSP430
#define __MSP430 1
#endif
#ifndef CACTL1_
#define CACTL1_ 0x0059
#endif
#ifndef CACTL1
#define CACTL1 0x0059
#endif
#ifndef TBCCR2_
#define TBCCR2_ 0x0196
#endif
#ifndef TBCCR2
#define TBCCR2 0x0196
#endif
#ifndef U1BR1_
#define U1BR1_ 0x007D
#endif
#ifndef U1BR1
#define U1BR1 0x007D
#endif
#ifndef CACTL24
#define CACTL24 0x10
#endif
#ifndef CACTL25
#define CACTL25 0x20
#endif
#ifndef CACTL26
#define CACTL26 0x40
#endif
#ifndef CACTL27
#define CACTL27 0x80
#endif
#ifndef TBCCTL0_
#define TBCCTL0_ 0x0182
#endif
#ifndef TBCCTL0
#define TBCCTL0 0x0182
#endif
#ifndef TBCCR3_
#define TBCCR3_ 0x0198
#endif
#ifndef TBCCR3
#define TBCCR3 0x0198
#endif
#ifndef __MSP430_IVCNT__
#define __MSP430_IVCNT__ 16
#endif
#ifndef __MSP430_IVCNT_
#define __MSP430_IVCNT_ 16
#endif
#ifndef TBCCTL1_
#define TBCCTL1_ 0x0184
#endif
#ifndef TBCCTL1
#define TBCCTL1 0x0184
#endif
#ifndef TBCCR4_
#define TBCCR4_ 0x019A
#endif
#ifndef TBCCR4
#define TBCCR4 0x019A
#endif
#ifndef __MSP430_HAS_COMPA__
#define __MSP430_HAS_COMPA__ 
#endif
#ifndef __MSP430_HAS_COMPA_
#define __MSP430_HAS_COMPA_ 
#endif
#ifndef TBCCTL2_
#define TBCCTL2_ 0x0186
#endif
#ifndef TBCCTL2
#define TBCCTL2 0x0186
#endif
#ifndef TBCCR5_
#define TBCCR5_ 0x019C
#endif
#ifndef TBCCR5
#define TBCCR5 0x019C
#endif
#ifndef WDTSSEL
#define WDTSSEL 0x0004
#endif
#ifndef FCTL1_
#define FCTL1_ 0x0128
#endif
#ifndef FCTL1
#define FCTL1 0x0128
#endif
#ifndef SSEL_ACLK
#define SSEL_ACLK SSEL_1
#endif
#ifndef U1CTL_
#define U1CTL_ 0x0078
#endif
#ifndef U1CTL
#define U1CTL 0x0078
#endif
#ifndef TBCCR6_
#define TBCCR6_ 0x019E
#endif
#ifndef TBCCR6
#define TBCCR6 0x019E
#endif
#ifndef WDTIS_0
#define WDTIS_0 0x0000
#endif
#ifndef WDTIS_1
#define WDTIS_1 0x0001
#endif
#ifndef WDTIS_2
#define WDTIS_2 0x0002
#endif
#ifndef WDTIS_3
#define WDTIS_3 0x0003
#endif
#ifndef FCTL2_
#define FCTL2_ 0x012A
#endif
#ifndef FCTL2
#define FCTL2 0x012A
#endif
#ifndef TBCCTL4_
#define TBCCTL4_ 0x018A
#endif
#ifndef TBCCTL4
#define TBCCTL4 0x018A
#endif
#ifndef FCTL3_
#define FCTL3_ 0x012C
#endif
#ifndef FCTL3
#define FCTL3 0x012C
#endif
#ifndef TBCCTL5_
#define TBCCTL5_ 0x018C
#endif
#ifndef TBCCTL5
#define TBCCTL5 0x018C
#endif
#ifndef P1IN_
#define P1IN_ 0x0020
#endif
#ifndef P1IN
#define P1IN 0x0020
#endif
#ifndef TBCCTL6_
#define TBCCTL6_ 0x018E
#endif
#ifndef TBCCTL6
#define TBCCTL6 0x018E
#endif
#ifndef DIVM0
#define DIVM0 0x10
#endif
#ifndef DIVM1
#define DIVM1 0x20
#endif
#ifndef TIMERA0_VECTOR
#define TIMERA0_VECTOR 12
#endif
#ifndef DCOCTL_
#define DCOCTL_ 0x0056
#endif
#ifndef DCOCTL
#define DCOCTL 0x0056
#endif
#ifndef CPUOFF
#define CPUOFF 0x0010
#endif
#ifndef WDTNMIES
#define WDTNMIES 0x0040
#endif
#ifndef __DEC128_MIN__
#define __DEC128_MIN__ 1E-6143DL
#endif
#ifndef __DEC128_MIN_
#define __DEC128_MIN_ 1E-6143DL
#endif
#ifndef __REGISTER_PREFIX__
#define __REGISTER_PREFIX__ 
#endif
#ifndef __REGISTER_PREFIX_
#define __REGISTER_PREFIX_ 
#endif
#ifndef __DBL_HAS_DENORM__
#define __DBL_HAS_DENORM__ 1
#endif
#ifndef __DBL_HAS_DENORM_
#define __DBL_HAS_DENORM_ 1
#endif
#ifndef U0RXBUF_
#define U0RXBUF_ 0x0076
#endif
#ifndef U0RXBUF
#define U0RXBUF 0x0076
#endif
#ifndef P2OUT_
#define P2OUT_ 0x0029
#endif
#ifndef P2OUT
#define P2OUT 0x0029
#endif
#ifndef PORT1_VECTOR
#define PORT1_VECTOR 8
#endif
#ifndef FRKEY
#define FRKEY 0x9600
#endif
#ifndef __MSP430_HAS_TA3__
#define __MSP430_HAS_TA3__ 
#endif
#ifndef __MSP430_HAS_TA3_
#define __MSP430_HAS_TA3_ 
#endif
#ifndef DIVS0
#define DIVS0 0x02
#endif
#ifndef DIVS1
#define DIVS1 0x04
#endif
#ifndef __MSP430_HAS_PORT1__
#define __MSP430_HAS_PORT1__ 
#endif
#ifndef __MSP430_HAS_PORT1_
#define __MSP430_HAS_PORT1_ 
#endif
#ifndef __NO_INLINE__
#define __NO_INLINE__ 1
#endif
#ifndef __NO_INLINE_
#define __NO_INLINE_ 1
#endif
#ifndef SCCI
#define SCCI 0x0400
#endif
#ifndef P2SEL_
#define P2SEL_ 0x002E
#endif
#ifndef P2SEL
#define P2SEL 0x002E
#endif
#ifndef __FLT_MANT_DIG__
#define __FLT_MANT_DIG__ 24
#endif
#ifndef __FLT_MANT_DIG_
#define __FLT_MANT_DIG_ 24
#endif
#ifndef __VERSION__
#define __VERSION__ "4.5.3"
#endif
#ifndef __VERSION_
#define __VERSION_ "4.5.3"
#endif
#ifndef U0BR0_
#define U0BR0_ 0x0074
#endif
#ifndef U0BR0
#define U0BR0 0x0074
#endif
#ifndef LISTEN
#define LISTEN 0x08
#endif
#ifndef WDTCTL_
#define WDTCTL_ 0x0120
#endif
#ifndef WDTCTL
#define WDTCTL 0x0120
#endif
#ifndef U0BR1_
#define U0BR1_ 0x0075
#endif
#ifndef U0BR1
#define U0BR1 0x0075
#endif
#ifndef UBR0_
#define UBR0_ 0x0074
#endif
#ifndef UBR0
#define UBR0 0x0074
#endif
#ifndef SCG0
#define SCG0 0x0040
#endif
#ifndef SCG1
#define SCG1 0x0080
#endif
#ifndef UBR1_
#define UBR1_ 0x0075
#endif
#ifndef UBR1
#define UBR1 0x0075
#endif
#ifndef TA0CCTL0_
#define TA0CCTL0_ 0x0162
#endif
#ifndef TA0CCTL0
#define TA0CCTL0 0x0162
#endif
#ifndef MC_UPTO_CCR0
#define MC_UPTO_CCR0 MC_1
#endif
#ifndef TBSSEL0
#define TBSSEL0 0x0100
#endif
#ifndef TBSSEL1
#define TBSSEL1 0x0200
#endif
#ifndef TBSSEL2
#define TBSSEL2 0x0400
#endif
#ifndef TA0CCTL1_
#define TA0CCTL1_ 0x0164
#endif
#ifndef TA0CCTL1
#define TA0CCTL1 0x0164
#endif
