jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x14x1.cpp
		unsigned int getUCA1BR0() {
#ifdef UCA1BR0_
			return UCA1BR0_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1BR1() {
#ifdef UCA1BR1_
			return UCA1BR1_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1MCTL() {
#ifdef UCA1MCTL_
			return UCA1MCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1STAT() {
#ifdef UCA1STAT_
			return UCA1STAT_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1RXBUF() {
#ifdef UCA1RXBUF_
			return UCA1RXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1TXBUF() {
#ifdef UCA1TXBUF_
			return UCA1TXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1ABCTL() {
#ifdef UCA1ABCTL_
			return UCA1ABCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1IRTCTL() {
#ifdef UCA1IRTCTL_
			return UCA1IRTCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1IRRCTL() {
#ifdef UCA1IRRCTL_
			return UCA1IRRCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1CTL0() {
#ifdef UCB1CTL0_
			return UCB1CTL0_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1CTL1() {
#ifdef UCB1CTL1_
			return UCB1CTL1_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1BR0() {
#ifdef UCB1BR0_
			return UCB1BR0_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1BR1() {
#ifdef UCB1BR1_
			return UCB1BR1_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1I2CIE() {
#ifdef UCB1I2CIE_
			return UCB1I2CIE_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1STAT() {
#ifdef UCB1STAT_
			return UCB1STAT_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1RXBUF() {
#ifdef UCB1RXBUF_
			return UCB1RXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1TXBUF() {
#ifdef UCB1TXBUF_
			return UCB1TXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1I2COA() {
#ifdef UCB1I2COA_
			return UCB1I2COA_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1I2CSA() {
#ifdef UCB1I2CSA_
			return UCB1I2CSA_;
#else
			return 0;
#endif
		}


		unsigned int getUSCIAB1TX_VECTOR() {
#ifdef USCIAB1TX_VECTOR
			return USCIAB1TX_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getUSCIAB1RX_VECTOR() {
#ifdef USCIAB1RX_VECTOR
			return USCIAB1RX_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getUC0IE() {
#ifdef UC0IE
			return UC0IE;
#else
			return 0;
#endif
		}


		unsigned int getUC0IFG() {
#ifdef UC0IFG
			return UC0IFG;
#else
			return 0;
#endif
		}


		unsigned int getUC1IE() {
#ifdef UC1IE
			return UC1IE;
#else
			return 0;
#endif
		}


		unsigned int getUC1IFG() {
#ifdef UC1IFG
			return UC1IFG;
#else
			return 0;
#endif
		}


		unsigned int getU0CTL() {
#ifdef U0CTL
			return U0CTL;
#else
			return 0;
#endif
		}


		unsigned int getU0TCTL() {
#ifdef U0TCTL_
			return U0TCTL_;
#else
			return 0;
#endif
		}


		unsigned int getU0RCTL() {
#ifdef U0RCTL_
			return U0RCTL_;
#else
			return 0;
#endif
		}


		unsigned int getU0MCTL() {
#ifdef U0MCTL_
			return U0MCTL_;
#else
			return 0;
#endif
		}


		unsigned int getU0BR0() {
#ifdef U0BR0_
			return U0BR0_;
#else
			return 0;
#endif
		}


		unsigned int getU0BR1() {
#ifdef U0BR1_
			return U0BR1_;
#else
			return 0;
#endif
		}


		unsigned int getU0RXBUF() {
#ifdef U0RXBUF_
			return U0RXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getU0TXBUF() {
#ifdef U0TXBUF_
			return U0TXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getU0ME() {
#ifdef U0ME
			return U0ME;
#else
			return 0;
#endif
		}


		unsigned int getU0IE() {
#ifdef U0IE
			return U0IE;
#else
			return 0;
#endif
		}


		unsigned int getU0IFG() {
#ifdef U0IFG
			return U0IFG;
#else
			return 0;
#endif
		}


		unsigned int getUSART0TX_VECTOR() {
#ifdef USART0TX_VECTOR
			return USART0TX_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getUSART0RX_VECTOR() {
#ifdef USART0RX_VECTOR
			return USART0RX_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getU1CTL() {
#ifdef U1CTL
			return U1CTL;
#else
			return 0;
#endif
		}


		unsigned int getU1TCTL() {
#ifdef U1TCTL_
			return U1TCTL_;
#else
			return 0;
#endif
		}


		unsigned int getU1RCTL() {
#ifdef U1RCTL_
			return U1RCTL_;
#else
			return 0;
#endif
		}


		unsigned int getU1MCTL() {
#ifdef U1MCTL_
			return U1MCTL_;
#else
			return 0;
#endif
		}


		unsigned int getU1BR0() {
#ifdef U1BR0_
			return U1BR0_;
#else
			return 0;
#endif
		}


		unsigned int getU1BR1() {
#ifdef U1BR1_
			return U1BR1_;
#else
			return 0;
#endif
		}


		unsigned int getU1RXBUF() {
#ifdef U1RXBUF_
			return U1RXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getU1TXBUF() {
#ifdef U1TXBUF_
			return U1TXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getU1ME() {
#ifdef U1ME
			return U1ME;
#else
			return 0;
#endif
		}


		unsigned int getU1IE() {
#ifdef U1IE
			return U1IE;
#else
			return 0;
#endif
		}


		unsigned int getU1IFG() {
#ifdef U1IFG
			return U1IFG;
#else
			return 0;
#endif
		}


		unsigned int getUSART1TX_VECTOR() {
#ifdef USART1TX_VECTOR
			return USART1TX_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getUSART1RX_VECTOR() {
#ifdef USART1RX_VECTOR
			return USART1RX_VECTOR;
#else
			return 0;
#endif
		}


		double getSRSEL() {
#ifdef SRSEL
			return SRSEL;
#else
			return 0;
#endif
		}


		double getSDCO() {
#ifdef SDCO
			return SDCO;
#else
			return 0;
#endif
		}


		double getDCOZERO() {
#ifdef DCOZERO
			return DCOZERO;
#else
			return 0;
#endif
		}


};

MSP430_VARIANT("msp430x14x1", msp430x14x1);

